# Aziza-Ali
برنامج آله حاسبه واختباره 
*تعليمات تشغيل البرنامج :

شرح برنامج الآلة الحاسبة (calculator.py):
- البرنامج فيه *دوت (functions)* للعمليات الحسابية الأساسية:
    - `add`: جمع
    - `subtract`: طرح
    - `multiply`: ضرب
    - `divide`: قسمة (مع فحص القسمة على صفر)
- الدالة `calculator`:
    - بتعرض قائمة بالعمليات.
    - بتاخد اختيار المستخدم والرقمين.
    - بتنفذ العملية المطلوبة وتطبع النتيجة.

*شرح برنامج الاختبار (test_calculator.py):*
- البرنامج بيستخدم *unittest* لاختبار دوت الآلة الحاسبة.
- فيه *اختبارات (tests)* لكل دالة:
    - `test_add`: اختبار الجمع.
    - `test_subtract`: اختبار الطرح.
    - `test_multiply`: اختبار الضرب.
    - `test_divide`: اختبار القسمة (مع فحص القسمة على صفر).
